zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/aes.h
#define AES_IDR_DATRDY_Pos                    (0)                                            /**< (AES_IDR) Data Ready Interrupt Disable Position */
#define AES_IDR_DATRDY_Msk                    (0x1U << AES_IDR_DATRDY_Pos)                   /**< (AES_IDR) Data Ready Interrupt Disable Mask */
#define AES_IDR_URAD_Pos                      (8)                                            /**< (AES_IDR) Unspecified Register Access Detection Interrupt Disable Position */
#define AES_IDR_URAD_Msk                      (0x1U << AES_IDR_URAD_Pos)                     /**< (AES_IDR) Unspecified Register Access Detection Interrupt Disable Mask */
#define AES_IDR_TAGRDY_Pos                    (16)                                           /**< (AES_IDR) GCM Tag Ready Interrupt Disable Position */
#define AES_IDR_TAGRDY_Msk                    (0x1U << AES_IDR_TAGRDY_Pos)                   /**< (AES_IDR) GCM Tag Ready Interrupt Disable Mask */
#define AES_IDR_Msk                           (0x00010101UL)                                 /**< (AES_IDR) Register Mask  */

/* -------- AES_IMR : (AES Offset: 0x18) (R/ 32) Interrupt Mask Register -------- */

typedef union
{
  struct
  {
    uint32_t DATRDY:1;                  /**< bit:      0  Data Ready Interrupt Mask                     */
    uint32_t :7;                        /**< bit:   1..7  Reserved                                      */
    uint32_t URAD:1;                    /**< bit:      8  Unspecified Register Access Detection Interrupt Mask */
    uint32_t :7;                        /**< bit:  9..15  Reserved                                      */
    uint32_t TAGRDY:1;                  /**< bit:     16  GCM Tag Ready Interrupt Mask                  */
    uint32_t :15;                       /**< bit: 17..31  Reserved                                      */
  };
  uint32_t w;
} __AES_IMR_bits_t;

#define AES_IMR_DATRDY_Pos                    (0)                                            /**< (AES_IMR) Data Ready Interrupt Mask Position */
#define AES_IMR_DATRDY_Msk                    (0x1U << AES_IMR_DATRDY_Pos)                   /**< (AES_IMR) Data Ready Interrupt Mask Mask */
#define AES_IMR_URAD_Pos                      (8)                                            /**< (AES_IMR) Unspecified Register Access Detection Interrupt Mask Position */
#define AES_IMR_URAD_Msk                      (0x1U << AES_IMR_URAD_Pos)                     /**< (AES_IMR) Unspecified Register Access Detection Interrupt Mask Mask */
#define AES_IMR_TAGRDY_Pos                    (16)                                           /**< (AES_IMR) GCM Tag Ready Interrupt Mask Position */
#define AES_IMR_TAGRDY_Msk                    (0x1U << AES_IMR_TAGRDY_Pos)                   /**< (AES_IMR) GCM Tag Ready Interrupt Mask Mask */
#define AES_IMR_Msk                           (0x00010101UL)                                 /**< (AES_IMR) Register Mask  */

/* -------- AES_ISR : (AES Offset: 0x1c) (R/ 32) Interrupt Status Register -------- */

typedef union
{
  struct
  {
    uint32_t DATRDY:1;                  /**< bit:      0  Data Ready (cleared by setting bit START or bit SWRST in AES_CR or by reading AES_ODATARx) */
    uint32_t :7;                        /**< bit:   1..7  Reserved                                      */
    uint32_t URAD:1;                    /**< bit:      8  Unspecified Register Access Detection Status (cleared by writing SWRST in AES_CR) */
    uint32_t :3;                        /**< bit:  9..11  Reserved                                      */
    uint32_t URAT:4;                    /**< bit: 12..15  Unspecified Register Access (cleared by writing SWRST in AES_CR) */
    uint32_t TAGRDY:1;                  /**< bit:     16  GCM Tag Ready                                 */
    uint32_t :15;                       /**< bit: 17..31  Reserved                                      */
  };
  uint32_t w;
} __AES_ISR_bits_t;

#define AES_ISR_DATRDY_Pos                    (0)                                            /**< (AES_ISR) Data Ready (cleared by setting bit START or bit SWRST in AES_CR or by reading AES_ODATARx) Position */
#define AES_ISR_DATRDY_Msk                    (0x1U << AES_ISR_DATRDY_Pos)                   /**< (AES_ISR) Data Ready (cleared by setting bit START or bit SWRST in AES_CR or by reading AES_ODATARx) Mask */
#define AES_ISR_URAD_Pos                      (8)                                            /**< (AES_ISR) Unspecified Register Access Detection Status (cleared by writing SWRST in AES_CR) Position */
#define AES_ISR_URAD_Msk                      (0x1U << AES_ISR_URAD_Pos)                     /**< (AES_ISR) Unspecified Register Access Detection Status (cleared by writing SWRST in AES_CR) Mask */
#define AES_ISR_URAT_Pos                      (12)                                           /**< (AES_ISR) Unspecified Register Access (cleared by writing SWRST in AES_CR) Position */
#define AES_ISR_URAT_Msk                      (0xFU << AES_ISR_URAT_Pos)                     /**< (AES_ISR) Unspecified Register Access (cleared by writing SWRST in AES_CR) Mask */
#define AES_ISR_URAT(value)                   (AES_ISR_URAT_Msk & ((value) << AES_ISR_URAT_Pos))
#define   AES_ISR_URAT_IDR_WR_PROCESSING_Val  (0x0U)                                         /**< (AES_ISR) Input Data register written during the data processing when SMOD = 0x2 mode.  */
#define   AES_ISR_URAT_ODR_RD_PROCESSING_Val  (0x1U)                                         /**< (AES_ISR) Output Data register read during the data processing.  */
#define   AES_ISR_URAT_MR_WR_PROCESSING_Val   (0x2U)                                         /**< (AES_ISR) Mode register written during the data processing.  */
#define   AES_ISR_URAT_ODR_RD_SUBKGEN_Val     (0x3U)                                         /**< (AES_ISR) Output Data register read during the sub-keys generation.  */
#define   AES_ISR_URAT_MR_WR_SUBKGEN_Val      (0x4U)                                         /**< (AES_ISR) Mode register written during the sub-keys generation.  */
#define   AES_ISR_URAT_WOR_RD_ACCESS_Val      (0x5U)                                         /**< (AES_ISR) Write-only register read access.  */
#define AES_ISR_URAT_IDR_WR_PROCESSING        (AES_ISR_URAT_IDR_WR_PROCESSING_Val << AES_ISR_URAT_Pos)  /**< (AES_ISR) Input Data register written during the data processing when SMOD = 0x2 mode. Position  */
#define AES_ISR_URAT_ODR_RD_PROCESSING        (AES_ISR_URAT_ODR_RD_PROCESSING_Val << AES_ISR_URAT_Pos)  /**< (AES_ISR) Output Data register read during the data processing. Position  */
#define AES_ISR_URAT_MR_WR_PROCESSING         (AES_ISR_URAT_MR_WR_PROCESSING_Val << AES_ISR_URAT_Pos)  /**< (AES_ISR) Mode register written during the data processing. Position  */
#define AES_ISR_URAT_ODR_RD_SUBKGEN           (AES_ISR_URAT_ODR_RD_SUBKGEN_Val << AES_ISR_URAT_Pos)  /**< (AES_ISR) Output Data register read during the sub-keys generation. Position  */
#define AES_ISR_URAT_MR_WR_SUBKGEN            (AES_ISR_URAT_MR_WR_SUBKGEN_Val << AES_ISR_URAT_Pos)  /**< (AES_ISR) Mode register written during the sub-keys generation. Position  */
#define AES_ISR_URAT_WOR_RD_ACCESS            (AES_ISR_URAT_WOR_RD_ACCESS_Val << AES_ISR_URAT_Pos)  /**< (AES_ISR) Write-only register read access. Position  */
#define AES_ISR_TAGRDY_Pos                    (16)                                           /**< (AES_ISR) GCM Tag Ready Position */
#define AES_ISR_TAGRDY_Msk                    (0x1U << AES_ISR_TAGRDY_Pos)                   /**< (AES_ISR) GCM Tag Ready Mask */
#define AES_ISR_Msk                           (0x0001F101UL)                                 /**< (AES_ISR) Register Mask  */

/* -------- AES_KEYWR : (AES Offset: 0x20) (/W 32) Key Word Register 0 -------- */

typedef union
{
  struct
  {
    uint32_t KEYW:32;                   /**< bit:  0..31  Key Word                                      */
  };
  uint32_t w;
} __AES_KEYWR_bits_t;

#define AES_KEYWR_KEYW_Pos                    (0)                                            /**< (AES_KEYWR) Key Word Position */
#define AES_KEYWR_KEYW_Msk                    (0xFFFFFFFFU << AES_KEYWR_KEYW_Pos)            /**< (AES_KEYWR) Key Word Mask */
#define AES_KEYWR_KEYW(value)                 (AES_KEYWR_KEYW_Msk & ((value) << AES_KEYWR_KEYW_Pos))
#define AES_KEYWR_Msk                         (0xFFFFFFFFUL)                                 /**< (AES_KEYWR) Register Mask  */

