zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/aes.h
/* -------- AES_IDATAR : (AES Offset: 0x40) (/W 32) Input Data Register 0 -------- */

typedef union
{
  struct
  {
    uint32_t IDATA:32;                  /**< bit:  0..31  Input Data Word                               */
  };
  uint32_t w;
} __AES_IDATAR_bits_t;

#define AES_IDATAR_IDATA_Pos                  (0)                                            /**< (AES_IDATAR) Input Data Word Position */
#define AES_IDATAR_IDATA_Msk                  (0xFFFFFFFFU << AES_IDATAR_IDATA_Pos)          /**< (AES_IDATAR) Input Data Word Mask */
#define AES_IDATAR_IDATA(value)               (AES_IDATAR_IDATA_Msk & ((value) << AES_IDATAR_IDATA_Pos))
#define AES_IDATAR_Msk                        (0xFFFFFFFFUL)                                 /**< (AES_IDATAR) Register Mask  */

/* -------- AES_ODATAR : (AES Offset: 0x50) (R/ 32) Output Data Register 0 -------- */

typedef union
{
  struct
  {
    uint32_t ODATA:32;                  /**< bit:  0..31  Output Data                                   */
  };
  uint32_t w;
} __AES_ODATAR_bits_t;

#define AES_ODATAR_ODATA_Pos                  (0)                                            /**< (AES_ODATAR) Output Data Position */
#define AES_ODATAR_ODATA_Msk                  (0xFFFFFFFFU << AES_ODATAR_ODATA_Pos)          /**< (AES_ODATAR) Output Data Mask */
#define AES_ODATAR_ODATA(value)               (AES_ODATAR_ODATA_Msk & ((value) << AES_ODATAR_ODATA_Pos))
#define AES_ODATAR_Msk                        (0xFFFFFFFFUL)                                 /**< (AES_ODATAR) Register Mask  */

/* -------- AES_IVR : (AES Offset: 0x60) (/W 32) Initialization Vector Register 0 -------- */

typedef union
{
  struct
  {
    uint32_t IV:32;                     /**< bit:  0..31  Initialization Vector                         */
  };
  uint32_t w;
} __AES_IVR_bits_t;

#define AES_IVR_IV_Pos                        (0)                                            /**< (AES_IVR) Initialization Vector Position */
#define AES_IVR_IV_Msk                        (0xFFFFFFFFU << AES_IVR_IV_Pos)                /**< (AES_IVR) Initialization Vector Mask */
#define AES_IVR_IV(value)                     (AES_IVR_IV_Msk & ((value) << AES_IVR_IV_Pos))
#define AES_IVR_Msk                           (0xFFFFFFFFUL)                                 /**< (AES_IVR) Register Mask  */

/* -------- AES_AADLENR : (AES Offset: 0x70) (R/W 32) Additional Authenticated Data Length Register -------- */

typedef union
{
  struct
  {
    uint32_t AADLEN:32;                 /**< bit:  0..31  Additional Authenticated Data Length          */
  };
  uint32_t w;
} __AES_AADLENR_bits_t;

#define AES_AADLENR_AADLEN_Pos                (0)                                            /**< (AES_AADLENR) Additional Authenticated Data Length Position */
#define AES_AADLENR_AADLEN_Msk                (0xFFFFFFFFU << AES_AADLENR_AADLEN_Pos)        /**< (AES_AADLENR) Additional Authenticated Data Length Mask */
#define AES_AADLENR_AADLEN(value)             (AES_AADLENR_AADLEN_Msk & ((value) << AES_AADLENR_AADLEN_Pos))
#define AES_AADLENR_Msk                       (0xFFFFFFFFUL)                                 /**< (AES_AADLENR) Register Mask  */

/* -------- AES_CLENR : (AES Offset: 0x74) (R/W 32) Plaintext/Ciphertext Length Register -------- */

typedef union
{
  struct
  {
    uint32_t CLEN:32;                   /**< bit:  0..31  Plaintext/Ciphertext Length                   */
  };
  uint32_t w;
} __AES_CLENR_bits_t;

#define AES_CLENR_CLEN_Pos                    (0)                                            /**< (AES_CLENR) Plaintext/Ciphertext Length Position */
#define AES_CLENR_CLEN_Msk                    (0xFFFFFFFFU << AES_CLENR_CLEN_Pos)            /**< (AES_CLENR) Plaintext/Ciphertext Length Mask */
#define AES_CLENR_CLEN(value)                 (AES_CLENR_CLEN_Msk & ((value) << AES_CLENR_CLEN_Pos))
#define AES_CLENR_Msk                         (0xFFFFFFFFUL)                                 /**< (AES_CLENR) Register Mask  */

/* -------- AES_GHASHR : (AES Offset: 0x78) (R/W 32) GCM Intermediate Hash Word Register 0 -------- */

typedef union
{
  struct
  {
    uint32_t GHASH:32;                  /**< bit:  0..31  Intermediate GCM Hash Word x                  */
  };
  uint32_t w;
} __AES_GHASHR_bits_t;

#define AES_GHASHR_GHASH_Pos                  (0)                                            /**< (AES_GHASHR) Intermediate GCM Hash Word x Position */
#define AES_GHASHR_GHASH_Msk                  (0xFFFFFFFFU << AES_GHASHR_GHASH_Pos)          /**< (AES_GHASHR) Intermediate GCM Hash Word x Mask */
#define AES_GHASHR_GHASH(value)               (AES_GHASHR_GHASH_Msk & ((value) << AES_GHASHR_GHASH_Pos))
#define AES_GHASHR_Msk                        (0xFFFFFFFFUL)                                 /**< (AES_GHASHR) Register Mask  */

/* -------- AES_TAGR : (AES Offset: 0x88) (R/ 32) GCM Authentication Tag Word Register 0 -------- */

typedef union
{
  struct
  {
    uint32_t TAG:32;                    /**< bit:  0..31  GCM Authentication Tag x                      */
  };
  uint32_t w;
} __AES_TAGR_bits_t;

#define AES_TAGR_TAG_Pos                      (0)                                            /**< (AES_TAGR) GCM Authentication Tag x Position */
#define AES_TAGR_TAG_Msk                      (0xFFFFFFFFU << AES_TAGR_TAG_Pos)              /**< (AES_TAGR) GCM Authentication Tag x Mask */
#define AES_TAGR_TAG(value)                   (AES_TAGR_TAG_Msk & ((value) << AES_TAGR_TAG_Pos))
#define AES_TAGR_Msk                          (0xFFFFFFFFUL)                                 /**< (AES_TAGR) Register Mask  */

/* -------- AES_CTRR : (AES Offset: 0x98) (R/ 32) GCM Encryption Counter Value Register -------- */

typedef union
{
  struct
  {
    uint32_t CTR:32;                    /**< bit:  0..31  GCM Encryption Counter                        */
  };
  uint32_t w;
} __AES_CTRR_bits_t;

#define AES_CTRR_CTR_Pos                      (0)                                            /**< (AES_CTRR) GCM Encryption Counter Position */
#define AES_CTRR_CTR_Msk                      (0xFFFFFFFFU << AES_CTRR_CTR_Pos)              /**< (AES_CTRR) GCM Encryption Counter Mask */
#define AES_CTRR_CTR(value)                   (AES_CTRR_CTR_Msk & ((value) << AES_CTRR_CTR_Pos))
#define AES_CTRR_Msk                          (0xFFFFFFFFUL)                                 /**< (AES_CTRR) Register Mask  */

/* -------- AES_GCMHR : (AES Offset: 0x9c) (R/W 32) GCM H Word Register 0 -------- */

typedef union
{
  struct
  {
    uint32_t H:32;                      /**< bit:  0..31  GCM H Word x                                  */
  };
  uint32_t w;
} __AES_GCMHR_bits_t;

#define AES_GCMHR_H_Pos                       (0)                                            /**< (AES_GCMHR) GCM H Word x Position */
#define AES_GCMHR_H_Msk                       (0xFFFFFFFFU << AES_GCMHR_H_Pos)               /**< (AES_GCMHR) GCM H Word x Mask */
#define AES_GCMHR_H(value)                    (AES_GCMHR_H_Msk & ((value) << AES_GCMHR_H_Pos))
#define AES_GCMHR_Msk                         (0xFFFFFFFFUL)                                 /**< (AES_GCMHR) Register Mask  */

/** \brief AES register offsets definitions */
#define AES_CR_OFFSET                (0x00)         /**< (AES_CR) Control Register Offset */
#define AES_MR_OFFSET                (0x04)         /**< (AES_MR) Mode Register Offset */
#define AES_IER_OFFSET               (0x10)         /**< (AES_IER) Interrupt Enable Register Offset */
#define AES_IDR_OFFSET               (0x14)         /**< (AES_IDR) Interrupt Disable Register Offset */
#define AES_IMR_OFFSET               (0x18)         /**< (AES_IMR) Interrupt Mask Register Offset */
#define AES_ISR_OFFSET               (0x1C)         /**< (AES_ISR) Interrupt Status Register Offset */
#define AES_KEYWR_OFFSET             (0x20)         /**< (AES_KEYWR) Key Word Register 0 Offset */
#define AES_IDATAR_OFFSET            (0x40)         /**< (AES_IDATAR) Input Data Register 0 Offset */
#define AES_ODATAR_OFFSET            (0x50)         /**< (AES_ODATAR) Output Data Register 0 Offset */
#define AES_IVR_OFFSET               (0x60)         /**< (AES_IVR) Initialization Vector Register 0 Offset */
#define AES_AADLENR_OFFSET           (0x70)         /**< (AES_AADLENR) Additional Authenticated Data Length Register Offset */
#define AES_CLENR_OFFSET             (0x74)         /**< (AES_CLENR) Plaintext/Ciphertext Length Register Offset */
#define AES_GHASHR_OFFSET            (0x78)         /**< (AES_GHASHR) GCM Intermediate Hash Word Register 0 Offset */
#define AES_TAGR_OFFSET              (0x88)         /**< (AES_TAGR) GCM Authentication Tag Word Register 0 Offset */
#define AES_CTRR_OFFSET              (0x98)         /**< (AES_CTRR) GCM Encryption Counter Value Register Offset */
#define AES_GCMHR_OFFSET             (0x9C)         /**< (AES_GCMHR) GCM H Word Register 0 Offset */

