zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/aes.h
/** \brief AES register API structure */
typedef struct
{
  __O   __AES_CR_bits_t                AES_CR;        /**< Offset: 0x00 ( /W  32) Control Register */
  __IO  __AES_MR_bits_t                AES_MR;        /**< Offset: 0x04 (R/W  32) Mode Register */
  __I   uint8_t                        Reserved1[0x08];
  __O   __AES_IER_bits_t               AES_IER;       /**< Offset: 0x10 ( /W  32) Interrupt Enable Register */
  __O   __AES_IDR_bits_t               AES_IDR;       /**< Offset: 0x14 ( /W  32) Interrupt Disable Register */
  __I   __AES_IMR_bits_t               AES_IMR;       /**< Offset: 0x18 (R/   32) Interrupt Mask Register */
  __I   __AES_ISR_bits_t               AES_ISR;       /**< Offset: 0x1C (R/   32) Interrupt Status Register */
  __O   __AES_KEYWR_bits_t             AES_KEYWR[8];  /**< Offset: 0x20 ( /W  32) Key Word Register 0 */
  __O   __AES_IDATAR_bits_t            AES_IDATAR[4]; /**< Offset: 0x40 ( /W  32) Input Data Register 0 */
  __I   __AES_ODATAR_bits_t            AES_ODATAR[4]; /**< Offset: 0x50 (R/   32) Output Data Register 0 */
  __O   __AES_IVR_bits_t               AES_IVR[4];    /**< Offset: 0x60 ( /W  32) Initialization Vector Register 0 */
  __IO  __AES_AADLENR_bits_t           AES_AADLENR;   /**< Offset: 0x70 (R/W  32) Additional Authenticated Data Length Register */
  __IO  __AES_CLENR_bits_t             AES_CLENR;     /**< Offset: 0x74 (R/W  32) Plaintext/Ciphertext Length Register */
  __IO  __AES_GHASHR_bits_t            AES_GHASHR[4]; /**< Offset: 0x78 (R/W  32) GCM Intermediate Hash Word Register 0 */
  __I   __AES_TAGR_bits_t              AES_TAGR[4];   /**< Offset: 0x88 (R/   32) GCM Authentication Tag Word Register 0 */
  __I   __AES_CTRR_bits_t              AES_CTRR;      /**< Offset: 0x98 (R/   32) GCM Encryption Counter Value Register */
  __IO  __AES_GCMHR_bits_t             AES_GCMHR[4];  /**< Offset: 0x9C (R/W  32) GCM H Word Register 0 */
} aes_registers_t;
/** @}  end of Advanced Encryption Standard */

#endif /* _PIC32CZ_CA70_AES_COMPONENT_H_ */
